DeviceNetworkEvents
| where RemoteUrl endswith ".exe"
| where InitiatingProcessFileName matches regex @"(FPSpy|KLogEXE)"
| project Timestamp, DeviceName, RemoteIP, RemoteUrl, InitiatingProcessFileName
| order by Timestamp desc