DeviceRegistryEvents
| where ActionType == "RegistryValueSet"
| where RegistryKey contains "CurrentControlSet\\Control\\Lsa\\DisableRestrictedAdmin" or RegistryKey contains "CurrentControlSet\\Control\\Lsa\\NoLMHash"