DeviceImageLoadEvents
| where FileName endswith "AclNumsInvertHost.dll"
    or FileName endswith "ModeBitmapNumericAnimate.dll"
    or FileName endswith "UnregisterAncestorAppendAuto.dll"
    or FileName endswith "DeregisterSeekUsers.dll"
    or FileName endswith "ScrollbarHandleGet.dll"
    or FileName endswith "PerformanceCaptionApi.dll"
    or FileName endswith "WowIcmpRemoveReg.dll"
    or FileName endswith "BlendMonitorStringBuild.dll"
    or FileName endswith "HandleFrequencyAll.dll"
    or FileName endswith "HardSwapColor.dll"
    or FileName endswith "LengthInMemoryActivate.dll"
    or FileName endswith "ParametersNamesPopup.dll"
    or FileName endswith "ModeFolderSignMove.dll"
    or FileName endswith "ChildPaletteConnected.dll"
    or FileName endswith "AddressResourcesSpec.dll"