DeviceNetworkEvents
| where ActionType == "ConnectionSuccess" and RemoteUrl != ""
| where Timestamp >= ago(24h)  // Dette filtrerer data fra de sidste 7 dage
| summarize TotalDataUploaded = sum(InitiatingProcessFileSize) by InitiatingProcessFileName
| extend TotalUploadGB  = TotalDataUploaded / (1024 * 1024 * 1024)
| where TotalDataUploaded  > 25 * 1024 * 1024 * 1024  // 25 GB in bytes
| order by TotalDataUploaded desc
